# Pandas – Lesvoorbeeld 6.

Heeft wat overeenkomsten met de eerdere lesvoorbeelden.

In [1]:
# importeren van de pandas library
import pandas as pd

In [2]:
# aanmaken van een inkopen tabel

# Eerst verkoopgegevens van drie winkels in een Pandas Series zetten
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

# De gegevens omzetten naar een dataframe 
# zowel voor de kolommen als de rijen is een 'index' nodig
# - de kolommen index komt uit de series
# - de rij index moeten we toevoegen
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])

# Afdrukken van het dataframe
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [3]:
# extra kolom toevoegen (allen dezelfde waarde)
df['Place'] = 'London'
df

          Name Item Purchased  Cost   Place
Store 1  Chris       Dog Food  22.5  London
Store 1  Kevyn   Kitty Litter   2.5  London
Store 2  Vinod      Bird Seed   5.0  London

## Kolom selecties

In [4]:
# Gegevens van één specifieke kolom bepalen, 
# LET OP ! resultaat is een series
df['Item Purchased']

Store 1        Dog Food
Store 1    Kitty Litter
Store 2       Bird Seed
Name: Item Purchased, dtype: object

In [5]:
# Gegevens van één specifieke kolom bepalen,
# LET OP ! resultaat is nu een 1 koloms dataframe
df[['Item Purchased']]

        Item Purchased
Store 1       Dog Food
Store 1   Kitty Litter
Store 2      Bird Seed

In [6]:
# Gegevens van twee kolommen bepalen
df[['Name','Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

## Rij selecties

In [7]:
# Gegevens van een specifieke rij afdrukken
# met behulp van de rij-index (resultaat is een series)
df.loc['Store 2']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Place                London
Name: Store 2, dtype: object

In [8]:
# Gegevens van een specifieke rij afdrukken
# met behulp van de rij-index (resultaat is een 1-rij dataframe)
df.loc[['Store 2']]

          Name Item Purchased  Cost   Place
Store 2  Vinod      Bird Seed   5.0  London

In [9]:
# Gegevens van een specifieke index, die niet uniek is, afdrukken
# DUS, let op ! indexen hoeven niet uniek te zijn
df.loc[['Store 1']]

          Name Item Purchased  Cost   Place
Store 1  Chris       Dog Food  22.5  London
Store 1  Kevyn   Kitty Litter   2.5  London

In [10]:
# met rij nummer, geeft series
df.iloc[1]

Name                     Kevyn
Item Purchased    Kitty Litter
Cost                       2.5
Place                   London
Name: Store 1, dtype: object

In [11]:
# met meerdere rij nummers
df.iloc[[0,2]]

          Name Item Purchased  Cost   Place
Store 1  Chris       Dog Food  22.5  London
Store 2  Vinod      Bird Seed   5.0  London

In [12]:
# met het ':' teken
df[0:2]  # rows: vanaf 0 tot 2

          Name Item Purchased  Cost   Place
Store 1  Chris       Dog Food  22.5  London
Store 1  Kevyn   Kitty Litter   2.5  London

In [13]:
# met het ':' teken, in plaats van .loc en met rij index
df['Store 1':'Store 2'] # vanaf tot/met !!!

          Name Item Purchased  Cost   Place
Store 1  Chris       Dog Food  22.5  London
Store 1  Kevyn   Kitty Litter   2.5  London
Store 2  Vinod      Bird Seed   5.0  London

## Gemixte Kolom en Rij Selecties

In [14]:
# met rij en kolom
df.loc['Store 2'] ['Name']
df.loc['Store 2','Name']  # deze is verwarrend, maar werkt wel

'Vinod'

In [15]:
# met kolom en rij (met .loc)
df['Name'].loc['Store 2']

'Vinod'

## Logische selecties

In [16]:
# Alle rijen met Cost >= 5
df[df['Cost'] >= 5]

          Name Item Purchased  Cost   Place
Store 1  Chris       Dog Food  22.5  London
Store 2  Vinod      Bird Seed   5.0  London

In [17]:
# Alle namen met Cost >= 5
df['Name'][df['Cost'] >= 5]

Store 1    Chris
Store 2    Vinod
Name: Name, dtype: object

In [18]:
# Dit werkt ook !
df[df['Cost'] >= 5]['Name']

Store 1    Chris
Store 2    Vinod
Name: Name, dtype: object